zookzook/azure-c-shared-utility/tests/platform_msp430_ut/platform_msp430_ut.c
// Copyright (c) Microsoft. All rights reserved.
// Licensed under the MIT license. See LICENSE file in the project root for full license information.

#ifdef __cplusplus
  #include <cstdbool>
  #include <cstddef>
  #include <cstdio>
  #include <cstdlib>
  #include <ctime>
#else
  #include <stdbool.h>
  #include <stddef.h>
  #include <stdio.h>
  #include <stdlib.h>
  #include <time.h>
#endif

#ifdef _CRTDBG_MAP_ALLOC
#include <crtdbg.h>
#endif

// Test framework `#includes`
#include "testrunnerswitcher.h"
#include "umock_c.h"
#include "umocktypes_charptr.h"
#include "umocktypes_stdint.h"
#include "umock_c_negative_tests.h"

#define disableNegativeTest(x, y) ((x) |= ((uint64_t)1 << (y)))
#define enableNegativeTest(x, y) ((x) &= ~((uint64_t)1 << (y)))
#define skipNegativeTest(x, y) ((x) & ((uint64_t)1 << (y)))

// External library dependencies
#include "driverlib.h"

static TEST_MUTEX_HANDLE g_testByTest;
static TEST_MUTEX_HANDLE g_dllByDll;

void
showMe (
    void
) {
    printf("\nExpected Calls: \n");
    printf("%s\n", umock_c_get_expected_calls());
    printf("\nActual Calls: \n");
    printf("%s\n", umock_c_get_actual_calls());
}

#define ENABLE_MOCKS
  // `#include` SDK dependencies here
  #include "azure_c_shared_utility\tlsio.h"
  #include "azure_c_shared_utility\tickcounter_msp430.h"
#undef ENABLE_MOCKS

#define MOCK_TICKCOUNTER (TICK_COUNTER_HANDLE)0x19790917

// Under test `#includes`
#include "azure_c_shared_utility/platform.h"

#define ENABLE_MOCKS

  // ** Mocking gpio.h module (driverlib.h)
  MOCK_FUNCTION_WITH_CODE(, uint8_t, GPIO_getInputPinValue, uint8_t, selectedPort, uint16_t, selectedPins)
  MOCK_FUNCTION_END(GPIO_INPUT_PIN_LOW);
  MOCK_FUNCTION_WITH_CODE(, void, GPIO_setAsInputPin, uint8_t, selectedPort, uint16_t, selectedPins)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, GPIO_setAsOutputPin, uint8_t, selectedPort, uint16_t, selectedPins)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, GPIO_setAsPeripheralModuleFunctionOutputPin, uint8_t, selectedPort, uint16_t, selectedPins, uint8_t, mode)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, GPIO_setOutputHighOnPin, uint8_t, selectedPort, uint16_t, selectedPins)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, GPIO_setOutputLowOnPin, uint8_t, selectedPort, uint16_t, selectedPins)
  MOCK_FUNCTION_END();

#undef ENABLE_MOCKS

DEFINE_ENUM_STRINGS(UMOCK_C_ERROR_CODE, UMOCK_C_ERROR_CODE_VALUES)

static void on_umock_c_error(UMOCK_C_ERROR_CODE error_code)
{
    char temp_str[256];
    (void)snprintf(temp_str, sizeof(temp_str), "umock_c reported error :%s", ENUM_TO_STRING(UMOCK_C_ERROR_CODE, error_code));
    ASSERT_FAIL(temp_str);
}

BEGIN_TEST_SUITE(platform_msp430_unittests)

TEST_SUITE_INITIALIZE(suite_init)
{
    int result;

    TEST_INITIALIZE_MEMORY_DEBUG(g_dllByDll);
    g_testByTest = TEST_MUTEX_CREATE();
    ASSERT_IS_NOT_NULL(g_testByTest);

    result = umock_c_init(on_umock_c_error);
    ASSERT_ARE_EQUAL(int, 0, result);
    result = umocktypes_charptr_register_types();
    ASSERT_ARE_EQUAL(int, 0, result);
    result = umocktypes_stdint_register_types();
    ASSERT_ARE_EQUAL(int, 0, result);

    REGISTER_UMOCK_ALIAS_TYPE(bool, char);
    REGISTER_UMOCK_ALIAS_TYPE(TICK_COUNTER_HANDLE, void *);

}

TEST_SUITE_CLEANUP(suite_cleanup)
{
    umock_c_deinit();

    TEST_MUTEX_DESTROY(g_testByTest);
    TEST_DEINITIALIZE_MEMORY_DEBUG(g_dllByDll);
}

TEST_FUNCTION_INITIALIZE(TestMethodInitialize)
{
    if (TEST_MUTEX_ACQUIRE(g_testByTest))
    {
        ASSERT_FAIL("our mutex is ABANDONED. Failure in test framework");
    }
}

TEST_FUNCTION_CLEANUP(TestMethodCleanup)
{
    TEST_MUTEX_RELEASE(g_testByTest);
}

// platform_init

/* SRS_UARTIO_27_000: [ `platform_init()` shall initialize the timer submodule by calling `(int)timer_a3_init(void)` ] */
/* SRS_UARTIO_27_002: [ `platform_init()` shall create a tickcounter instance by calling `(TICK_COUNTER_HANDLE)tickcounter_create()` ] */
/* SRS_UARTIO_27_004: [ `platform_init()` shall prepare to read the SIM808 status pin by calling `(void)GPIO_setAsInputPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P3` for the `selectedPort` and `GPIO_PIN5` as the `selectedPins` ] */
/* SRS_UARTIO_27_005: [ `platform_init()` shall prepare the SIM808 PWRKEY pin by calling `(void)GPIO_setAsOutputPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_006: [ `platform_init()` shall set the PWRKEY pin to low (inactive) by calling `(void)GPIO_setOutputLowOnPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_007: [ `platform_init()` shall check the status line of the SIM808 by calling `(uint8_t)GPIO_getInputPinValue(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P3` for the `selectedPort` and `GPIO_PIN5` as the `selectedPins` ] */
/* SRS_UARTIO_27_015: [ `platform_init()` shall configure the GPIO for UART by calling `(void)GPIO_setAsPeripheralModuleFunctionOutputPin(uint8_t selectedPort, uint16_t selectedPins, uint8_t mode)` using port two, `GPIO_PORT_P2`, pins `GPIO_PIN5` and `GPIO_PIN6`, and UART functionality with the `GPIO_SECONDARY_MODULE_FUNCTION` identifier. ] */
/* SRS_UARTIO_27_016: [ `platform_init()` shall destroy the tickcounter instance by calling `(void)tickcounter_destroy(TICK_COUNTER_HANDLE)` using the value returned by `tickcounter_create()` ] */
/* SRS_UARTIO_27_018: [ If no errors occurred during execution, `platform_init()` shall return 0 ] */
TEST_FUNCTION(platform_init_SCENARIO_success_sim808_on)
{
    // Arrange
    int error;

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(timer_a3_init());
    EXPECTED_CALL(tickcounter_create())
        .SetReturn(MOCK_TICKCOUNTER);
    STRICT_EXPECTED_CALL(GPIO_setAsInputPin(GPIO_PORT_P3, GPIO_PIN5));
    STRICT_EXPECTED_CALL(GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_HIGH);
    STRICT_EXPECTED_CALL(GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P2, (GPIO_PIN5|GPIO_PIN6), GPIO_SECONDARY_MODULE_FUNCTION));
    STRICT_EXPECTED_CALL(tickcounter_destroy(MOCK_TICKCOUNTER));

    // Act
    error = platform_init();

