zookzook/azure-c-shared-utility/tests/platform_msp430_ut/platform_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_EQUAL(int, 0, error);

    // Cleanup
}

/* SRS_UARTIO_27_010: [ If the SIM808 status line equals `GPIO_INPUT_PIN_LOW`, then `platform_init()` shall poll `(int)tickcounter_get_current_ms(TICK_COUNTER_HANDLE handle, tickcounter_ms_t * tick_counter)` until it returns a result greater than or equal to 550 milliseconds ] */
/* SRS_UARTIO_27_011: [ If the SIM808 status line equals `GPIO_INPUT_PIN_LOW`, then `platform_init()` shall set the PWRKEY pin to high (active) by calling `(void)GPIO_setOutputHighOnPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_012: [ If the SIM808 status line equals `GPIO_INPUT_PIN_LOW`, then `platform_init()` shall poll `(int)tickcounter_get_current_ms(TICK_COUNTER_HANDLE handle, tickcounter_ms_t * tick_counter)` until it returns a result greater than or equal to 1100 milliseconds from the last time captured ] */
/* SRS_UARTIO_27_014: [ If the SIM808 status line equals `GPIO_INPUT_PIN_LOW`, then `platform_init()` shall set the PWRKEY pin to low (inactive) by calling `(void)GPIO_setOutputLowOnPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_017: [ If the SIM808 status line equals `GPIO_INPUT_PIN_LOW`, `platform_init()` shall poll `(uint8_t)GPIO_getInputPinValue(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P3` for the `selectedPort` and `GPIO_PIN5` as the `selectedPins` until `GPIO_INPUT_PIN_HIGH` is returned ] */
TEST_FUNCTION(platform_init_SCENARIO_success_sim808_off)
{
    // Arrange
    int error;
    size_t random_number;
    tickcounter_ms_t mark_ms, ms;
    (void)srand((unsigned int)time(NULL));

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(timer_a3_init());
    EXPECTED_CALL(tickcounter_create())
        .SetReturn(MOCK_TICKCOUNTER);
    STRICT_EXPECTED_CALL(GPIO_setAsInputPin(GPIO_PORT_P3, GPIO_PIN5));
    STRICT_EXPECTED_CALL(GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_LOW);
    // Simulate polling tick counter
    for (ms = mark_ms = 0;  ; ms += (rand() % 256)) {
        if (0 == ms) { continue; }
        STRICT_EXPECTED_CALL(tickcounter_get_current_ms(MOCK_TICKCOUNTER, IGNORED_PTR_ARG))
            .CopyOutArgumentBuffer(2, &ms, sizeof(ms))
            .IgnoreArgument(2)
            .SetReturn(0);
        if (550 <= ms) { break; }
    }
    STRICT_EXPECTED_CALL(GPIO_setOutputHighOnPin(GPIO_PORT_P4, GPIO_PIN6));
    // Simulate polling tick counter
    for (mark_ms = ms ;  ; ms += (rand() % 512)) {
        STRICT_EXPECTED_CALL(tickcounter_get_current_ms(MOCK_TICKCOUNTER, IGNORED_PTR_ARG))
            .CopyOutArgumentBuffer(2, &ms, sizeof(ms))
            .IgnoreArgument(2)
            .SetReturn(0);
        if ((1100 + mark_ms) <= ms) { break; }
    }
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    // Simulate polling STATUS pin
    random_number = (rand() % 4);
    for (size_t i = 0; i < random_number; ++i) {
        STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
            .SetReturn(GPIO_INPUT_PIN_LOW);
    }
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_HIGH);
    STRICT_EXPECTED_CALL(GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P2, (GPIO_PIN5 | GPIO_PIN6), GPIO_SECONDARY_MODULE_FUNCTION));
    STRICT_EXPECTED_CALL(tickcounter_destroy(MOCK_TICKCOUNTER));

    // Act
    error = platform_init();

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_EQUAL(int, 0, error);

    // Cleanup
}

/* SRS_UARTIO_27_001: [ If the timer submodule fails to initialize properly, then `platform_init()` shall fail immediately and return a non-zero value ] */
/* SRS_UARTIO_27_003: [ If the call to `tickcounter_create()` returns null, then `platform_init()` shall fail immediately and return a non-zero value ] */
/* SRS_UARTIO_27_013: [ If any call to `(int)tickcounter_get_current_ms(TICK_COUNTER_HANDLE handle, tickcounter_ms_t * tick_counter)` returns a non-zero value, then `platform_init()` will exit immediately and return a non-zero value ] */
TEST_FUNCTION(platform_init_SCENARIO_negative_tests)
{
    // Arrange
    int negativeTestsInitResult = umock_c_negative_tests_init();
    ASSERT_ARE_EQUAL(int, 0, negativeTestsInitResult);
    uint64_t negativeTestsToSkip = 0;
    size_t test_index = 0;
    int error;
    size_t random_number;
    tickcounter_ms_t mark_ms, ms;
    (void)srand((unsigned int)time(NULL));

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(timer_a3_init())
        .SetFailReturn(__LINE__)
        .SetReturn(0);
    enableNegativeTest(negativeTestsToSkip, test_index++);
    EXPECTED_CALL(tickcounter_create())
        .SetFailReturn(NULL)
        .SetReturn(MOCK_TICKCOUNTER);
    enableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setAsInputPin(GPIO_PORT_P3, GPIO_PIN5));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_LOW);
    disableNegativeTest(negativeTestsToSkip, test_index++);
    // Simulate polling tick counter
    for (ms = 0, mark_ms = 0 ;  ; ms += (rand() % 256)) {
        if (0 == ms) { continue; }
        STRICT_EXPECTED_CALL(tickcounter_get_current_ms(MOCK_TICKCOUNTER, IGNORED_PTR_ARG))
            .CopyOutArgumentBuffer(2, &ms, sizeof(ms))
            .IgnoreArgument(2)
            .SetFailReturn(__LINE__)
            .SetReturn(0);
        enableNegativeTest(negativeTestsToSkip, test_index++);
        if (550 <= ms) { break; }
    }
    STRICT_EXPECTED_CALL(GPIO_setOutputHighOnPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    // Simulate polling tick counter
    for (mark_ms = ms ;  ; ms += (rand() % 512)) {
        STRICT_EXPECTED_CALL(tickcounter_get_current_ms(MOCK_TICKCOUNTER, IGNORED_PTR_ARG))
            .CopyOutArgumentBuffer(2, &ms, sizeof(ms))
            .IgnoreArgument(2)
            .SetFailReturn(__LINE__)
            .SetReturn(0);
        enableNegativeTest(negativeTestsToSkip, test_index++);
        if ((1100 + mark_ms) <= ms) { break; }
    }
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    // Simulate polling STATUS pin
    random_number = (rand() % 4);
    for (size_t i = 0; i < random_number; ++i) {
        STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
            .SetReturn(GPIO_INPUT_PIN_LOW);
        disableNegativeTest(negativeTestsToSkip, test_index++);
    }
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_HIGH);
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P2, (GPIO_PIN5 | GPIO_PIN6), GPIO_SECONDARY_MODULE_FUNCTION));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(tickcounter_destroy(MOCK_TICKCOUNTER));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    umock_c_negative_tests_snapshot();

    ASSERT_IS_TRUE(test_index < sizeof(negativeTestsToSkip) * 8);
    for (size_t i = 0; i < umock_c_negative_tests_call_count(); ++i)
    {
        if ( skipNegativeTest(negativeTestsToSkip, i) ) { continue; }

        umock_c_negative_tests_reset();
        umock_c_negative_tests_fail_call(i);

        // Act
        error = platform_init();

