zookzook/azure-c-shared-utility/tests/platform_msp430_ut/platform_msp430_ut.c
        // Assert
        ASSERT_ARE_NOT_EQUAL(int, 0, error);
    }

    // Cleanup
    umock_c_negative_tests_deinit();
}


// platform_deinit

/* SRS_UARTIO_27_019: [ `platform_deinit()` shall create a tickcounter instance by calling `(TICK_COUNTER_HANDLE)tickcounter_create()` ] */
/* SRS_UARTIO_27_021: [ `platform_deinit()` shall prepare to read the SIM808 status pin by calling `(void)GPIO_setAsInputPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P3` for the `selectedPort` and `GPIO_PIN5` as the `selectedPins` ] */
/* SRS_UARTIO_27_022: [ `platform_deinit()` shall prepare the SIM808 PWRKEY pin by calling `(void)GPIO_setAsOutputPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_023: [ `platform_deinit()` shall set the PWRKEY pin to low(inactive) by calling `(void)GPIO_setOutputLowOnPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_024: [ `platform_deinit()` shall check the status line of the SIM808 by calling `(uint8_t)GPIO_getInputPinValue(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P3` for the `selectedPort` and `GPIO_PIN5` as the `selectedPins` ] */
/* SRS_UARTIO_27_031: [ `platform_deinit()` shall destroy the tickcounter instance by calling `(void)tickcounter_destroy(TICK_COUNTER_HANDLE)` using the value returned by `tickcounter_create()` ] */
/* SRS_UARTIO_27_032: [ `platform_deinit()` shall deinitialize the timer submodule by calling `(void)timer_a3_deinit(void)` ] */
TEST_FUNCTION(platform_deinit_SCENARIO_success_sim808_off)
{
    // Arrange

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(tickcounter_create())
        .SetReturn(MOCK_TICKCOUNTER);
    STRICT_EXPECTED_CALL(GPIO_setAsInputPin(GPIO_PORT_P3, GPIO_PIN5));
    STRICT_EXPECTED_CALL(GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5));
    STRICT_EXPECTED_CALL(tickcounter_destroy(MOCK_TICKCOUNTER));
    EXPECTED_CALL(timer_a3_deinit());

    // Act
    platform_deinit();

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_026: [ If the SIM808 status line equals `GPIO_INPUT_PIN_HIGH`, then `platform_deinit()` shall set the PWRKEY pin to high (active) by calling `(void)GPIO_setOutputHighOnPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_028: [ If the SIM808 status line equals `GPIO_INPUT_PIN_HIGH`, then `platform_deinit()` shall poll `(int)tickcounter_get_current_ms(TICK_COUNTER_HANDLE handle, tickcounter_ms_t * tick_counter)` until it returns a result greater than or equal to 1100 milliseconds ] */
/* SRS_UARTIO_27_030: [ If the SIM808 status line equals `GPIO_INPUT_PIN_HIGH`, then `platform_deinit()` shall set the PWRKEY pin to low (inactive) by calling `(void)GPIO_setOutputLowOnPin(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P4` for the `selectedPort` and `GPIO_PIN6` as the `selectedPins` ] */
/* SRS_UARTIO_27_033: [ If the SIM808 status line equals `GPIO_INPUT_PIN_HIGH`, then `platform_deinit()` shall poll `(uint8_t)GPIO_getInputPinValue(uint8_t selectedPort, uint16_t selectedPins)` using `GPIO_PORT_P3` for the `selectedPort` and `GPIO_PIN5` as the `selectedPins` until `GPIO_INPUT_PIN_LOW` is returned } */
TEST_FUNCTION(platform_deinit_SCENARIO_success_sim808_on)
{
    // Arrange
    size_t random_number;
    tickcounter_ms_t mark_ms, ms;
    (void)srand((unsigned int)time(NULL));

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(tickcounter_create())
        .SetReturn(MOCK_TICKCOUNTER);
    STRICT_EXPECTED_CALL(GPIO_setAsInputPin(GPIO_PORT_P3, GPIO_PIN5));
    STRICT_EXPECTED_CALL(GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_HIGH);
    STRICT_EXPECTED_CALL(GPIO_setOutputHighOnPin(GPIO_PORT_P4, GPIO_PIN6));
    // Simulate polling tick counter
    for (ms = mark_ms = 0 ;  ; ms += (rand() % 256)) {
        if (0 == ms) { continue; }
        STRICT_EXPECTED_CALL(tickcounter_get_current_ms(MOCK_TICKCOUNTER, IGNORED_PTR_ARG))
            .CopyOutArgumentBuffer(2, &ms, sizeof(ms))
            .IgnoreArgument(2)
            .SetReturn(0);
        if (1100 <= ms) { break; }
    }
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    // Simulate polling STATUS pin
    random_number = (rand() % 4);
    for (size_t i = 0; i < random_number; ++i) {
        STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
            .SetReturn(GPIO_INPUT_PIN_HIGH);
    }
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_LOW);
    STRICT_EXPECTED_CALL(tickcounter_destroy(MOCK_TICKCOUNTER));
    EXPECTED_CALL(timer_a3_deinit());

    // Act
    platform_deinit();

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_020: [ If the call to `tickcounter_create()` returns null, then `platform_deinit()` shall fail immediately ] */
/* SRS_UARTIO_27_029: [ If any call to `(int)tickcounter_get_current_ms(TICK_COUNTER_HANDLE handle, tickcounter_ms_t * tick_counter)` returns a non - zero value, then `platform_deinit()` will exit immediately ] */
TEST_FUNCTION(platform_deinit_SCENARIO_negative_tests)
{
    // Arrange
    int negativeTestsInitResult = umock_c_negative_tests_init();
    ASSERT_ARE_EQUAL(int, 0, negativeTestsInitResult);
    uint64_t negativeTestsToSkip = 0;
    size_t test_index = 0;
    size_t random_number;
    tickcounter_ms_t mark_ms, ms;
    (void)srand((unsigned int)time(NULL));

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(tickcounter_create())
        .SetFailReturn(NULL)
        .SetReturn(MOCK_TICKCOUNTER);
    enableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setAsInputPin(GPIO_PORT_P3, GPIO_PIN5));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_HIGH);
    STRICT_EXPECTED_CALL(GPIO_setOutputHighOnPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    // Simulate polling tick counter
    for (ms = mark_ms = 0; ; ms += (rand() % 256)) {
        if (0 == ms) { continue; }
        STRICT_EXPECTED_CALL(tickcounter_get_current_ms(MOCK_TICKCOUNTER, IGNORED_PTR_ARG))
            .CopyOutArgumentBuffer(2, &ms, sizeof(ms))
            .IgnoreArgument(2)
            .SetFailReturn(__LINE__)
            .SetReturn(0);
        disableNegativeTest(negativeTestsToSkip, test_index++);
        //enableNegativeTest(negativeTestsToSkip, test_index++);
        if (1100 <= ms) { break; }
    }
    STRICT_EXPECTED_CALL(GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN6));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    // Simulate polling STATUS pin
    random_number = (rand() % 4);
    for (size_t i = 0; i < random_number; ++i) {
        STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
            .SetReturn(GPIO_INPUT_PIN_HIGH);
        disableNegativeTest(negativeTestsToSkip, test_index++);
    }
    STRICT_EXPECTED_CALL(GPIO_getInputPinValue(GPIO_PORT_P3, GPIO_PIN5))
        .SetReturn(GPIO_INPUT_PIN_LOW);
    disableNegativeTest(negativeTestsToSkip, test_index++);
    STRICT_EXPECTED_CALL(tickcounter_destroy(MOCK_TICKCOUNTER));
    disableNegativeTest(negativeTestsToSkip, test_index++);
    EXPECTED_CALL(timer_a3_deinit());
    disableNegativeTest(negativeTestsToSkip, test_index++);
    umock_c_negative_tests_snapshot();

