zookzook/azure-c-shared-utility/tests/platform_msp430_ut/platform_msp430_ut.c
    for (size_t i = 0; i < umock_c_negative_tests_call_count(); ++i)
    {
        if (skipNegativeTest(negativeTestsToSkip, i)) { continue; }

        umock_c_negative_tests_reset();
        umock_c_negative_tests_fail_call(i);

        // Act
        platform_deinit();

        // Assert
        ASSERT_IS_TRUE(true);  // You know I would never lie to you, baby...
    }

    // Cleanup
    umock_c_negative_tests_deinit();
}


// platform_get_default_tlsio

TEST_FUNCTION(platform_get_default_tlsio_SCENARIO_success)
{
    // Arrange

    // Expected call listing
    umock_c_reset_all_calls();

    // Act

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}
/* SRS_UARTIO_27_034: [ `platform_get_default_tlsio()` shall return a non-`NULL` pointer to an `IO_INTERFACE_DESCRIPTION` structure. ] */  
/* SRS_UARTIO_27_035: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_close()`. ] */  
/* SRS_UARTIO_27_036: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_create()`. ] */  
/* SRS_UARTIO_27_037: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_destroy()`. ] */  
/* SRS_UARTIO_27_038: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_dowork()`. ] */  
/* SRS_UARTIO_27_039: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_open()`. ] */  
/* SRS_UARTIO_27_040: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_retrieveoptions()`. ] */  
/* SRS_UARTIO_27_041: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_send()`. ] */  
/* SRS_UARTIO_27_042: [ `platform_get_default_tlsio()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `tlsio_setoption()`. ] */  


END_TEST_SUITE(platform_msp430_unittests)

